# ── Taps ────────────────────────────────────────────────────────────────────
tap "fluxcd/tap"
tap "hashicorp/tap"
tap "siderolabs/tap"

# ── Core utilities ──────────────────────────────────────────────────────────
brew "coreutils"
brew "findutils"
brew "bash"
brew "zsh"
brew "less"
brew "wget"

# ── Modern CLI replacements ─────────────────────────────────────────────────
brew "bat"          # cat replacement with syntax highlighting
brew "eza"          # ls replacement with icons and git status
brew "fd"           # find replacement
brew "ripgrep"      # grep replacement
brew "delta"        # diff/git pager with syntax highlighting
brew "zoxide"       # cd replacement, learns your habits
brew "atuin"        # shell history with fuzzy search and sync
brew "fzf"          # fuzzy finder
brew "starship"     # cross-shell prompt

# ── Development tools ───────────────────────────────────────────────────────
brew "git"
brew "nvim"
brew "vim"
brew "jq"
brew "just"
brew "direnv"
brew "lazygit"
brew "k9s"
brew "pre-commit"
brew "terraform"
brew "terraform-docs"
brew "tflint"

# ── Security ────────────────────────────────────────────────────────────────
brew "gnupg"
brew "gnupg2"
brew "pinentry-mac"
brew "keychain"

# ── Languages & package managers ────────────────────────────────────────────
# Runtimes also managed via rustup/ghcup externally
brew "nodejs"
brew "go"

# ── System libraries ────────────────────────────────────────────────────────
brew "gnutls"
brew "icu4c"
brew "libidn"
brew "unixodbc"
brew "zlib"
brew "pigz"

# ── Shell plugin manager ───────────────────────────────────────────────────
# Plugins themselves managed via ~/.zsh_plugins.txt
brew "antidote"

# ── Utilities ───────────────────────────────────────────────────────────────
brew "aspell"
brew "djvu2pdf"
brew "html2text"
brew "lynx"
brew "markdownlint-cli2"
brew "msmtp"
brew "oha"
brew "psutils"
brew "reattach-to-user-namespace"
brew "urlview"
brew "age"
brew "fluxcd/tap/flux"
brew "gh"
brew "hugo"
brew "kustomize"
brew "pandoc"
brew "shellcheck"
brew "shfmt"
brew "sops"
brew "talosctl"
brew "gcalcli"

# ── AI tools ────────────────────────────────────────────────────────────────
brew "opencode"
brew "gemini-cli"

# ── Fonts ───────────────────────────────────────────────────────────────────
cask "font-fira-code"
cask "font-meslo-lg-nerd-font"

# ── Applications ────────────────────────────────────────────────────────────
cask "amethyst"
cask "brave-browser"
cask "bruno"
cask "claude-code"
cask "devpod"
cask "docker-desktop"
cask "drawio"
cask "kitty"
cask "menumeters"
cask "signal"
cask "spotify"
cask "vlc"
