# Completion system (must load before other plugins that use completion)
mattmc3/ez-compinit
zsh-users/zsh-completions kind:fpath

# fzf-tab (must load after compinit but before other plugins that wrap widgets)
Aloxaf/fzf-tab

# Prezto aliases — git (gco, gb, gws, etc.) and docker (dkcU, dkc, etc.)
sorin-ionescu/prezto path:modules/git/functions kind:fpath
sorin-ionescu/prezto path:modules/git/alias.zsh
sorin-ionescu/prezto path:modules/docker/alias.zsh

# Autosuggestions
zsh-users/zsh-autosuggestions

# Syntax highlighting (load near end)
zdharma-continuum/fast-syntax-highlighting kind:defer

# History substring search (load after syntax highlighting)
zsh-users/zsh-history-substring-search

# Powerlevel10k prompt
romkatv/powerlevel10k
